# The notebook for analysing the Database

In [1]:
## Libraries 
%matplotlib inline

import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import sqlite3
import numpy as np

In [28]:
# location
path = 'c:/sqlite-windows/'
theDB = 'OSM.db'

# the database
with sqlite3.connect(path+theDB) as con:
    #q = pd.read_sql_query('PRAGMA encoding="UTF-8"', con)
    nodes = pd.read_sql_query("SELECT * from nodes", con)   
    nodes_tags = pd.read_sql_query("SELECT * from nodes_tags", con)
    addr = pd.read_sql_query('SELECT DISTINCT value FROM nodes_tags \
                                WHERE key="street" ORDER BY value LIMIT 20',con)
    sch = pd.read_sql_query('SELECT id,key,value FROM nodes_tags, \
                                (SELECT id as idd FROM nodes_tags WHERE value="school") AS subquery \
                                WHERE id = idd AND key= "name" ORDER by value',con)
    cities =

In [20]:
nodes.head()

,id,lat,lon,user,uid,version,changeset,timestamp
0,644169,48.904907,2.195935,osmmaker,210173,3,26474158,2014-11-01T02:01:56Z
1,644170,48.906158,2.194022,osmmaker,210173,4,26474158,2014-11-01T02:01:56Z
2,644171,48.907185,2.192674,jmorais,5404,1,191925,2007-01-11T18:35:55Z
3,644172,48.909258,2.189542,Marcussacapuces91,37548,2,313659,2008-12-10T22:08:03Z
4,644173,48.910085,2.187915,Marcussacapuces91,37548,2,568845,2009-02-19T21:41:38Z

In [21]:
nodes_tags.head()

       id   key                 value     type
0  644169   ele             31.380127  regular
1  644169  time  2006-03-18T16:45:21Z  regular
2  644170   ele             33.302856  regular
3  644170  time  2006-03-18T16:45:28Z  regular
4  644171   ele             32.341553  regular

In [22]:
addr.head(20)

                                    value
0                      Allée Henri Wallon
1                   Allée Jacques Prévert
2             Allée Jean Baptiste Lamarck
3                       Allée Jules Ferry
4                       Allée Marie Curie
5                    Allée René Descartes
6                        Allée de l'Arche
7                   Allée des 3 musiciens
8                       Avenue Albert 1er
9                       Avenue Botticelli
10                          Avenue Carnot
11               Avenue Charles de Gaulle
12              Avenue Franklin Roosevelt
13                  Avenue François Arago
14  Avenue Frédéric et Irène Joliot Curie
15                     Avenue Félix Faure
16                    Avenue Gabriel Péri
17                        Avenue Gambetta
18              Avenue Georges Clemenceau
19              Avenue Georges Clémenceau

In [29]:
# All schools names
print sch

            id   key                                              value
0   3921975998  name                                  Collège Jean Macé
1    275563810  name                              Collège Les Martinets
2   2174740055  name                                  Collège Malmaison
3   3765893786  name                              Collège Marcel Pagnol
4   1909985251  name                        Collège les Champs Philippe
5    163727960  name                                     Crèche du Parc
6   4514556390  name                                              ESSEC
7   2388836766  name                         Groupe scolaire Tuck Stell
8    560160040  name                           Institut Medico-Éducatif
9   3765693115  name                                Lycée Paul Langevin
10  2102923751  name                    Lycée des métiers Louis Blériot
11  3765893787  name  Lycée polyvalent Gustave Eiffel, lycée des mét...
12  1909981363  name       Lycée professionnel des métiers La Tournelle
13  3765893792  name  Section d'enseignement professionnel du lycée ...
14  1861381705  name  Section d'enseignement professionnel du lycée ...
15  1827854711  name                                 École Claude Monet
16  3778783081  name                  École Elémentaire Charles Péguy B
17  3778783079  name                     École Maternelle Charles Péguy
18  2112602760  name             École Noor Inayat Khan, dite Madeleine
19  3778783080  name                     École Primaire Charles Péguy A
20  1947350751  name                     École maternelle Auguste Rodin
21  3062780744  name                 École maternelle Cité de l'enfance
22  1325227101  name                      École maternelle Défense 2000
23   227420647  name                        École maternelle Félix Pyat
24   767421017  name                  École maternelle Honoré de Balzac
25   275563938  name                     École maternelle Les Martinets
26  2147177945  name                       École maternelle Paquerettes
27  4212377829  name       École maternelle et élémentaire des Cottages
28  3766019686  name                        École primaire La Malmaison
29   275563791  name                        École primaire Les Trianons
30  1909987138  name                          École primaire René Guest
31  3765894767  name               École primaire publique Albert Camus
32   471197050  name                 École Élementaire des Bons Raisins
33   767421011  name                           École Élémentaire Balzac
34  1947350752  name                    École élémentaire Auguste Rodin
35  1952633205  name                  École élémentaire Bertie Albrecht
36   275563525  name                      École élémentaire Jules Ferry
37  4532161701  name                       École élémentaire République